## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
ecs.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 21 to add, 0 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                              NAME                                                              |
|----------|--------------------------------------------------------------------------------------------------------------------------------|
| recreate | `aws_cloudwatch_log_stream.saas_procurement_stream`                                                                            |
| add      | `aws_security_group_rule.ecs_egress_database`                                                                                  |
|          | `module.saas_procurement.aws_appautoscaling_policy.this[&quot;cpu&quot;]`                                                                |
|          | `module.saas_procurement.aws_appautoscaling_policy.this[&quot;memory&quot;]`                                                             |
|          | `module.saas_procurement.aws_appautoscaling_target.this[0]`                                                                    |
|          | `module.saas_procurement.aws_cloudwatch_log_group.this`                                                                        |
|          | `module.saas_procurement.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0]`                                    |
|          | `module.saas_procurement.aws_ecs_cluster.this[0]`                                                                              |
|          | `module.saas_procurement.aws_ecs_cluster_capacity_providers.this[0]`                                                           |
|          | `module.saas_procurement.aws_ecs_service.this`                                                                                 |
|          | `module.saas_procurement.aws_ecs_task_definition.this`                                                                         |
|          | `module.saas_procurement.aws_iam_policy.this_task_exec`                                                                        |
|          | `module.saas_procurement.aws_iam_role.this_task`                                                                               |
|          | `module.saas_procurement.aws_iam_role.this_task_exec`                                                                          |
|          | `module.saas_procurement.aws_iam_role_policy_attachment.this_task_exec`                                                        |
|          | `module.saas_procurement.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |
|          | `module.saas_procurement.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda`                                |
|          | `module.saas_procurement.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda`                                  |
|          | `module.saas_procurement.module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|          | `module.saas_procurement.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder`                                  |
|          | `module.saas_procurement.module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
| delete   | `aws_cloudwatch_log_group.saas_procurement_group`                                                                              |
|          | `aws_cloudwatch_log_subscription_filter.sentinel_forwarder`                                                                    |
|          | `aws_ecs_cluster.saas_procurement`                                                                                             |
|          | `aws_ecs_service.saas-procurement-app-service`                                                                                 |
|          | `aws_ecs_task_definition.saas_procurement`                                                                                     |
|          | `module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda`                                                 |
|          | `module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda`                                                           |
|          | `module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda`                                                             |
|          | `module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                                           |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                                             |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]`                            |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/saas-procurement/actions/runs/6644975126).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.saas_procurement_group will be destroyed
  # (because aws_cloudwatch_log_group.saas_procurement_group is not in configuration)
  - resource "aws_cloudwatch_log_group" "saas_procurement_group" {
      - arn               = "arn:aws:logs:ca-central-1:394954348146:log-group:/ecs/saas-procurement-app" -> null
      - id                = "/ecs/saas-procurement-app" -> null
      - name              = "/ecs/saas-procurement-app" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Name" = "saas-procurement-log-group"
        } -> null
      - tags_all          = {
          - "Name" = "saas-procurement-log-group"
        } -> null
    }

  # aws_cloudwatch_log_stream.saas_procurement_stream must be replaced
-/+ resource "aws_cloudwatch_log_stream" "saas_procurement_stream" {
      ~ arn            = "arn:aws:logs:ca-central-1:394954348146:log-group:/ecs/saas-procurement-app:log-stream:saas-procurement-log-stream" -> (known after apply)
      ~ id             = "saas-procurement-log-stream" -> (known after apply)
      ~ log_group_name = "/ecs/saas-procurement-app" -> "/aws/ecs/saas-procurement-cluster" # forces replacement
        name           = "saas-procurement-log-stream"
    }

  # aws_cloudwatch_log_subscription_filter.sentinel_forwarder will be destroyed
  # (because aws_cloudwatch_log_subscription_filter.sentinel_forwarder is not in configuration)
  - resource "aws_cloudwatch_log_subscription_filter" "sentinel_forwarder" {
      - destination_arn = "arn:aws:lambda:ca-central-1:394954348146:function:sentinel-forwarder" -> null
      - distribution    = "Random" -> null
      - filter_pattern  = "[w1=\"*\"]" -> null
      - id              = "cwlsf-687876709" -> null
      - log_group_name  = "/ecs/saas-procurement-app" -> null
      - name            = "All ECS logs" -> null
    }

  # aws_ecs_cluster.saas_procurement will be destroyed
  # (because aws_ecs_cluster.saas_procurement is not in configuration)
  - resource "aws_ecs_cluster" "saas_procurement" {
      - arn                = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> null
      - name               = "saas-procurement-cluster" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # aws_ecs_service.saas-procurement-app-service will be destroyed
  # (because aws_ecs_service.saas-procurement-app-service is not in configuration)
  - resource "aws_ecs_service" "saas-procurement-app-service" {
      - cluster                            = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:ca-central-1:394954348146:service/saas-procurement-cluster/saas_procurement-service" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "saas_procurement-service" -> null
      - platform_version                   = "1.4.0" -> null
      - propagate_tags                     = "SERVICE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {
          - "CostCentre" = "saas-procurement"
        } -> null
      - tags_all                           = {
          - "CostCentre" = "saas-procurement"
        } -> null
      - task_definition                    = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task:17" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "saas-procurement" -> null
          - container_port   = 8000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:394954348146:targetgroup/saas-procurement/ea3e0fa73fdcf4ec" -> null
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-0d1ca7e7e561a219f",
            ] -> null
          - subnets          = [
              - "subnet-061d1ba72b3063d92",
              - "subnet-08b6b67d74b37e07b",
              - "subnet-0d3a016c7742a6dab",
            ] -> null
        }
    }

  # aws_ecs_task_definition.saas_procurement will be destroyed
  # (because aws_ecs_task_definition.saas_procurement is not in configuration)
  - resource "aws_ecs_task_definition" "saas_procurement" {
      - arn                      = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task:17" -> null
      - arn_without_revision     = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "394954348146.dkr.ecr.ca-central-1.amazonaws.com/saas-procurement:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/saas-procurement-app"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-saas_procurement"
                        }
                    }
                  - mountPoints      = []
                  - name             = "saas-procurement"
                  - portMappings     = [
                      - {
                          - appProtocol   = "http"
                          - containerPort = 8000
                          - hostPort      = 8000
                          - name          = "saas-procurement-8000-tcp"
                          - protocol      = "tcp"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::394954348146:role/saas_procurement-task-role" -> null
      - family                   = "saas-procurement-task" -> null
      - id                       = "saas-procurement-task" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 17 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - task_role_arn            = "arn:aws:iam::394954348146:role/saas_procurement-task-role" -> null

      - runtime_platform {
          - cpu_architecture        = "X86_64" -> null
          - operating_system_family = "LINUX" -> null
        }
    }

  # aws_security_group_rule.ecs_egress_database will be created
  + resource "aws_security_group_rule" "ecs_egress_database" {
      + description              = "Allow ECS to talk to the RDS cluster"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0d1ca7e7e561a219f"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-051638cd60aef88c3"
      + to_port                  = 5432
      + type                     = "egress"
    }

  # module.saas_procurement.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = ""
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.saas_procurement.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.saas_procurement.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/saas-procurement-cluster/saas-procurement-app-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.saas_procurement.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/saas-procurement-cluster/saas-procurement-app-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.saas_procurement.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/saas-procurement-cluster/saas-procurement-app-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
    }

  # module.saas_procurement.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/saas-procurement-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
    }

  # module.saas_procurement.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "this_sentinel_forwarder" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + filter_pattern  = "[w1=\"*\"]"
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/saas-procurement-cluster"
      + name            = "All cluster logs"
      + role_arn        = (known after apply)
    }

  # module.saas_procurement.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "saas-procurement-cluster"
      + tags               = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.saas_procurement.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "saas-procurement-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.saas_procurement.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "saas-procurement-app-service"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "saas-procurement"
          + container_port   = 8000
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:394954348146:targetgroup/saas-procurement/ea3e0fa73fdcf4ec"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0d1ca7e7e561a219f",
            ]
          + subnets          = [
              + "subnet-061d1ba72b3063d92",
              + "subnet-08b6b67d74b37e07b",
              + "subnet-0d3a016c7742a6dab",
            ]
        }
    }

  # module.saas_procurement.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image                  = "394954348146.dkr.ecr.ca-central-1.amazonaws.com/saas-procurement:latest"
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/saas-procurement-cluster"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "task"
                        }
                    }
                  + name                   = "saas-procurement"
                  + portMappings           = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 8000
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = true
                  + ulimits                = [
                      + {
                          + hardLimit = 1000000
                          + name      = "nofile"
                          + softLimit = 1000000
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::394954348146:role/saas_procurement-task-role"
      + family                   = "saas-procurement-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::394954348146:role/saas_procurement-task-role"

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.saas_procurement.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "saas-procurement-task_ecs_task_exec_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
    }

  # module.saas_procurement.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "saas-procurement-task_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.saas_procurement.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "saas-procurement-task_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.saas_procurement.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "saas-procurement-task_ecs_task_exec_role"
    }

  # module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be destroyed
  # (because aws_cloudwatch_log_group.sentinel_forwarder_lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      - arn               = "arn:aws:logs:ca-central-1:394954348146:log-group:/aws/lambda/sentinel-forwarder" -> null
      - id                = "/aws/lambda/sentinel-forwarder" -> null
      - name              = "/aws/lambda/sentinel-forwarder" -> null
      - retention_in_days = 14 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "CostCentre" = "SaasProcurement"
        } -> null
      - tags_all          = {
          - "CostCentre" = "SaasProcurement"
        } -> null
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be destroyed
  # (because aws_iam_policy.sentinel_forwarder_lambda is not in configuration)
  - resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      - arn       = "arn:aws:iam::394954348146:policy/SentinelForwarderLambda-sentinel-forwarder" -> null
      - id        = "arn:aws:iam::394954348146:policy/SentinelForwarderLambda-sentinel-forwarder" -> null
      - name      = "SentinelForwarderLambda-sentinel-forwarder" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:394954348146:log-group:/aws/lambda/sentinel-forwarder:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAVX5I5CZZFZIO3RA7J" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda will be destroyed
  # (because aws_iam_role.sentinel_forwarder_lambda is not in configuration)
  - resource "aws_iam_role" "sentinel_forwarder_lambda" {
      - arn                   = "arn:aws:iam::394954348146:role/SentinelForwarderLambda-sentinel-forwarder" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-06-29T16:59:36Z" -> null
      - force_detach_policies = false -> null
      - id                    = "SentinelForwarderLambda-sentinel-forwarder" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::394954348146:policy/SentinelForwarderLambda-sentinel-forwarder",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SentinelForwarderLambda-sentinel-forwarder" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-10-25T18:48:43Z"
              - region         = "ca-central-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAVX5I5CZZOKQCJLASE" -> null
    }

  # module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be destroyed
  # (because aws_iam_role_policy_attachment.sentinel_forwarder_lambda is not in configuration)
  - resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      - id         = "SentinelForwarderLambda-sentinel-forwarder-20230629165936635400000001" -> null
      - policy_arn = "arn:aws:iam::394954348146:policy/SentinelForwarderLambda-sentinel-forwarder" -> null
      - role       = "SentinelForwarderLambda-sentinel-forwarder" -> null
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be destroyed
  # (because aws_lambda_function.sentinel_forwarder is not in configuration)
  - resource "aws_lambda_function" "sentinel_forwarder" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:394954348146:function:sentinel-forwarder" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "Lambda function to forward AWS logs to Azure Sentinel" -> null
      - filename                       = "/tmp/sentinel_forwarder.py.zip" -> null
      - function_name                  = "sentinel-forwarder" -> null
     ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
